//
//  NewsArticles.swift
//  Navigation
//
//  Created by pumbaaflag on 18.03.2022.
//

import Foundation

var newsArticles: [News] = [
News(author: "1... Состоялся выход крупного обновления 2.6 для Diablo 2: Resurrected",
     description: "Diablo II: Resurrected получила обновление 2.6. Согласно сообщению Blizzard, патч уже доступен для загрузки, но игрокам придется подождать до пятницы, чтобы начать третий сезон. Рейтинговая лестница станет доступна 17 февраля.",
     image: "1",
     likes: 150,
     views: 350),
News(author: "2... Игроки ОБТ Diablo 4 испытывают те же проблемы, что и неделю назад, но в несколько меньших масштабах",
     description: "В открытом бета-тесте Diablo IV, который начался сегодня в 19:00, игроки сталкиваются с теми же проблемами, что и во время раннего бета-теста на прошлой неделе.",
     image: "2",
     likes: 111,
     views: 234),
]
